DataProcessors/ОсновнаяФормаОбращенияКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОсновнаяФормаОбращенияКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СписокОбращений</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/ОбращенияВПоддержку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОбращенияВПоддержку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрНакопления</xr:Item>
				<xr:Item>InformationRegister.ИсторияИзмененийОбращений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПоступления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРеакцииФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРешенияФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тональность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоНазначениеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РешитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРеакцииРегламент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРешенияРегламент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияСообщений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВремя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ОсновнаяФормаОбращенияКлиента/Forms/ОсновнаяФормаКлиенты/Ext/Form/Module.bsl
//&НаКлиенте
//Процедура СоздатьНовоеОбращение(Команда)
//    ОткрытьФормуСозданияОбращения();
//КонецПроцедуры 
&НаКлиенте
Процедура СоздатьНовоеОбращение(Команда)
    
    ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыСозданияОбращения", ЭтотОбъект);
    
    ПараметрыФИО = Новый Структура("ФИО", Объект.ФИО);
    
    ОткрытьФорму("Обработка.ФормаСозданияОбращенияКлиента1.Форма.ФормаСозданияОбращения",
                  ПараметрыФИО,,,,, ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  


    
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПослеЗакрытияФормыСозданияОбращения(РезультатЗакрытия, ПараметрыОповещения) Экспорт 
    
    Если РезультатЗакрытия = Неопределено Тогда
        // Форма была закрыта без создания обращения (например, нажата отмена)
        Возврат;
    КонецЕсли;
    
    Если РезультатЗакрытия = Истина Тогда
        Сообщить("Обращение успешно отправлено!", СтатусСообщения.Обычное);
        // Обновление списка обращений
        ОбновитьСписокОбращенийНаСервере();
    Иначе
        Сообщить("Ошибка при создании обращения!", СтатусСообщения.Ошибка);
    КонецЕсли;
    
КонецПроцедуры














//&НаКлиенте
//Процедура ОткрытьФормуСозданияОбращения() 
//	ПараметрыФИО = Новый Структура("ФИО", Объект.ФИО);
//	
//    ОткрытьФорму("Обработка.ФормаСозданияОбращенияКлиента1.Форма.ФормаСозданияОбращения",
//	              ПараметрыФИО,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//КонецПроцедуры 


&НаКлиенте
Процедура ОбновитьСписок(Команда)
    ОбновитьСписокОбращенийНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокОбращенийНаСервере()
 
    Объект.СписокОбращений.Очистить();
    
	//ОбъектТекущийПользователь = Объект.ФИО; //Получаем объект из справочника со всеми реквизитами (наименование, email, телефон и тд)
	//ТекущийПользователь = ОбъектТекущийПользователь.Наименование; // Берем только резвизит Наименование (тип строка, здесь ФИО клиента)
	
	//ОбъектТекущийПользователь = Объект.ФИО; //Получаем объект из справочника со всеми реквизитами (наименование, email, телефон и тд)
	ТекущийПользователь = Объект.ФИО; // Берем только резвизит Наименование (тип строка, здесь ФИО клиента)

	
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ОбращенияВПоддержку.Ссылка,
    |    ОбращенияВПоддержку.Тема,
    |    ОбращенияВПоддержку.Статус,
    |    ОбращенияВПоддержку.Дата,
    |    ОбращенияВПоддержку.Номер
    |ИЗ
    |    Документ.ОбращенияВПоддержку КАК ОбращенияВПоддержку
    |ГДЕ
    |    ОбращенияВПоддержку.Клиент = &ТекущийПользователь
    |УПОРЯДОЧИТЬ ПО
    |    Дата УБЫВ";
    
    Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
    
    РезультатЗапроса = Запрос.Выполнить().Выбрать();
    
    Пока РезультатЗапроса.Следующий() Цикл
        НоваяСтрока = Объект.СписокОбращений.Добавить(); 

        НоваяСтрока.Ссылка = РезультатЗапроса.Ссылка;
        НоваяСтрока.Тема = РезультатЗапроса.Тема;
        НоваяСтрока.Статус = РезультатЗапроса.Статус;
        НоваяСтрока.Дата = РезультатЗапроса.Дата;
        НоваяСтрока.Номер = РезультатЗапроса.Номер;
    КонецЦикла;
    
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьОбращение(Команда)
	
	// Получаем ссылку на выбранное обращение
 	ТекущиеДанные = ЭтаФорма.Элементы.СписокОбращений.ТекущиеДанные;  
    СсылкаНаОбращение = ТекущиеДанные.Ссылка;
	
    ОткрытьФормуПросмотра(СсылкаНаОбращение);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПросмотра(СсылкаНаОбращение)
	
	// В самой форме ФормаПросмотра нужно задать параметр с таким же именем "ПараметрФормыПросмотра" 
    ПараметрыФормы = Новый Структура("ПараметрФормыПросмотра", СсылкаНаОбращение);
    
    ОткрытьФорму("Обработка.ФормаПросмотраОбращенияКлиента1.Форма.ФормаПросмотра",
				  ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры

&НаСервере
Функция ПолучитьИмя()  
	Имя = ПолноеИмяПользователя();
	Возврат Имя
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИмяТекущПольз = ПолучитьИмя();
	Объект.ФИО = ИмяТекущПольз;
	ОбновитьСписокОбращенийНаСервере();
КонецПроцедуры
